---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.GetSimpleType
source: html/e92e6b9d-c9a2-fb04-0742-5a21f75f6906.htm
---
# Autodesk.Revit.DB.IFC.IFCData.GetSimpleType Method

Gets the IFC type name.

## Syntax (C#)
```csharp
public string GetSimpleType()
```

## Returns
The name.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - No type assigned or it is not a simple type.